[
  {
    "title": "Etherscan's API V2: A Pragmatic Step for Sustainable Blockchain Infra",
    "date": "2025-12-05T00:00:00.000Z",
    "authors": [
      "Elem Oghenekaro"
    ],
    "excerpt": "Exploring Etherscan's API tier adjustments and the changing landscape of blockchain data tools.",
    "url": "2025-12-02-etherscan-api-v2-advantages.html",
    "content": "<h1>Etherscan&#39;s API V2: A Pragmatic Step for Sustainable Blockchain Infra</h1>\n<p>I was intrigued (and a bit saddened) to see the recent ripple effects from Etherscan&#39;s announcement on their free API tier. </p>\n<p>For those catching up: exactly two weeks ago, November 22, 2025, Etherscan reduced coverage for the free tier by <a href=\"https://info.etherscan.com/whats-changing-in-the-free-api-tier-coverage-and-why/\">&quot;roughly 10%&quot;</a> to sustainably support demand for its API.</p>\n<blockquote>\n<p>tldr; the old free tier is now a Lite plan (at 25% of the prior entry-level price).</p>\n</blockquote>\n<p>Affected chains (i.e. the 10% reduction) like Base, Optimism, and BNB Smart Chain (BSC) now require the new Lite plan for full access. We&#39;ve seen this pattern before - the &quot;Lite plan&quot; often becomes the new &quot;Free tier&quot; to meet economic realities.</p>\n<p>Ironically, I had touched on this <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7402779843509215232/\">topic</a> two months ago:</p>\n<p><img src=\"/assets/images/linkedin_post.png\" alt=\"LinkedIn Post Discussion\"></p>\n<p>So no, this isn&#39;t a &quot;rug pull,&quot; it&#39;s a business reality check in a multichain ecosystem that&#39;s exploding with TPS and volume. Etherscan has subsidized free access for over a decade, powering countless dApps, wallets, and analytics tools without which we&#39;d be scrambling. Kudos to the team for transparency in their blog post, explaining how surging demands (faster blocks, higher tx volumes) made full free coverage unsustainable. </p>\n<p>This isn&#39;t new. Five days prior, DappRadar shut down after seven years due to unsustainable costs. The era of infinite free subsidies is over. [sadly!].</p>\n<p><img src=\"/assets/images/dappradar_annoucement.png\" alt=\"DappRadar Announcement\"></p>\n<p>However, the conversation shouldn&#39;t stop at pricing...</p>\n<p>While business models are being adjusted, improvements are being made. Much attention has focused on the API pricing, but Etherscan&#39;s rollout of <strong>API V2</strong> represents a significant technical advancement that deserves equal attention. Having recently migrated my DeFi tools to V2, I&#39;ve discovered substantial benefits that go beyond the surface-level changes.</p>\n<blockquote>\n<p>Every Dev tool should have a unified multichain architecture</p>\n</blockquote>\n<p><strong>The Game-Changer:</strong> Single API key for 60+ blockchain networks.</p>\n<pre><code class=\"language-javascript\">// V1 - Fragmented approach\nconst v1Endpoints = {\n  ethereum: &#39;https://api.etherscan.io/api&#39;,\n  arbitrum: &#39;https://api.arbiscan.io/api&#39;,\n  base: &#39;https://api.basescan.org/api&#39;,\n  // ...separate for each chain\n}\n\n// V2 - Unified approach\nconst v2BaseUrl = &#39;https://api.etherscan.io/v2/api&#39;\nconst getTransaction = (txHash, chainId) =&gt; \n  `${v2BaseUrl}?chainid=${chainId}&amp;action=tx&amp;txhash=${txHash}`\n</code></pre>\n<p>This is something I&#39;ve been waiting for, single authentication point across all networks, it&#39;s a game-changer for multi-chain applications. And its future-proof for new chain integrations, the kind of architecture that will be needed as the multichain space matures.</p>\n<p>While researching the Balancer V2 and Yearn exploit last week, I simulated them using the V2 API and it was a breeze.</p>\n<pre><code class=\"language-python\"># Before V2 - Complex multi-chain management\nclass MultiChainAnalyzerV1:\n    def __init__(self):\n        self.chains = {\n            &#39;ethereum&#39;: {&#39;url&#39;: &#39;...&#39;, &#39;api_key&#39;: &#39;key1&#39;},\n            &#39;arbitrum&#39;: {&#39;url&#39;: &#39;...&#39;, &#39;api_key&#39;: &#39;key2&#39;},\n            &#39;base&#39;: {&#39;url&#39;: &#39;...&#39;, &#39;api_key&#39;: &#39;key3&#39;},\n            # ...and so on\n        }\n    \n    def analyze_exploit(self, chain, tx_hash):\n        config = self.chains[chain]\n        # Different implementation for each chain\n\n# After V2 - Streamlined approach\nclass MultiChainAnalyzerV2:\n    def __init__(self):\n        self.base_url = &#39;https://api.etherscan.io/v2/api&#39;\n        self.api_key = &#39;single_key_for_all_chains&#39;\n    \n    def analyze_exploit(self, chain_id, tx_hash):\n        # Same implementation for all chains\n        return self._make_request(chain_id, &#39;tx&#39;, {&#39;txhash&#39;: tx_hash})\n</code></pre>\n<p>That said, the timing, right amid Devconnect chaos, stung. I think that can be better and with more notice.</p>\n<p>And yes, alternatives exist: Alchemy, Infura, Blockscout, Routescan. But Etherscan&#39;s has been the go-to for years, its UX and reliability set a high bar that&#39;s tough to match without their scale.</p>\n<p>From a professional lens, this is Web3 maturing. Explorers aren&#39;t pure public goods—though perhaps they should be?</p>\n<p>Finally, I must say, the adjustments spotlight innovation opportunities:</p>\n<ul>\n<li><strong>Open-source repos</strong> for verified contract code</li>\n<li><strong>Community-funded indexers</strong> and data providers</li>\n<li><strong>ICP-style on-protocol queries</strong> to reduce RPC reliance</li>\n<li><strong>Decentralized alternatives</strong> that need to gain traction.</li>\n</ul>\n<blockquote>\n<p>Shoutout to Etherscan for keeping verified contracts free across all tiers and chains. </p>\n</blockquote>\n<p>This adjustment foreshadows something else: the eventuality of protocol fee switches and the impact they will have on the ecosystem. As crypto matures and enters the institutional era, we also enter the revenue era. Hopefully, all of these growth will spur more innovation and competition. </p>\n<p>I&#39;m already excited about alternatives gaining traction. Recent favorite is <a href=\"https://orb.helius.dev/\">Helius&#39; Orb</a> in addition to <a href=\"https://solscan.io/\">Solscan</a> (acquired by Etherscan) and <a href=\"https://solana.fm/\">Solanafm</a>, and <a href=\"https://routescan.io/\">Routescan</a> for multichain EVM.</p>\n<p>The more options, the merrier, competition drives innovation.</p>\n<p>The Web3 ecosystem is growing up, and with maturity comes both challenges and opportunities. Etherscan&#39;s V2 API represents a pragmatic step forward and we will see more of this in the future. </p>\n",
    "banner": {
      "path": "assets/images/free_apis_banner.jpeg",
      "alt": "Etherscan API V2 Architecture Diagram"
    },
    "external": false
  },
  {
    "title": "Pipe PoP Nodes are for Everyone",
    "date": "2025-03-09T00:00:00.000Z",
    "authors": [
      "Elem Oghenekaro"
    ],
    "excerpt": "Introducing a comprehensive toolkit for managing Pipe PoP nodes - making decentralized CDN infrastructure accessible to everyone through simplified node management and deployment.",
    "url": "https://x.com/elemoghenekaro/status/1898770308556804174",
    "content": "<h1>Pipe PoP Nodes are for Everyone</h1>\n<blockquote class=\"twitter-tweet\">\n<a href=\"https://x.com/elemoghenekaro/status/1898770308556804174\"></a>\n</blockquote>\n<script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n<p>I&#39;ve been tinkering with a side project: a comprehensive toolkit to run a Pipe PoP (Points of Presence) node on Pipe Network, a decentralized Content Delivery Network (CDN). While traditional CDNs speed up the internet by caching data on servers near you, Pipe Network lets you run a node to propagate data. More nodes mean lower latency ⚡️ and you&#39;re rewarded for owning a piece of the network.</p>\n<p>This project represents my ongoing work in making decentralized infrastructure more accessible to everyone. I believe if we simplify the process of running a PoP node, we can expand the network&#39;s reach and improve internet performance globally while enabling more people to participate in the decentralized web. </p>\n",
    "banner": {
      "path": "assets/images/banner_dark.png",
      "alt": "Elem Oghenekaro Banner"
    },
    "external": true,
    "source": "X"
  }
]